"DOWNGRADE_TITLE" = "较新版本的 Java 已安装。";

"DOWNGRADE_MESSAGE" = "您正在尝试安装 %1$@, 但是 %2$@ 已安装。\n有关详细信息, 请访问 java.com/newerversionexists。";

"Restore Security Prompts" = "还原安全提示";

"Browser Plug-in Disabled" = "浏览器插件已禁用";

"Continue" = "继续";

"Close" = "关闭";

"Install" = "安装";

"Finish" = "完成";

"You have Successfully Installed %@ \nand the Ask extension(s)." = "您已成功安装 %1$@ \n和 Ask 扩展。";

"The security level has been set to a minimum value of High." = "安全级别已设置为“高”的最小值。";

/* Dynamic welcome string */
"Welcome to the %@ Installer" = "欢迎使用 %1$@ 安装程序";

/* Dynamic complete string */
"You have successfully installed %@." = "您已成功安装 %1$@。";

"Information about" = "有关 Oracle Java SE 信息指南的重要信息：";

"Oracle has announced" = "即将进行变动，这些变动将会影响未来您对 Oracle Java SE 的发行版的访问权。 ";

"Corporate users may" = "公司用户最早将于 2019 年 1 月受到影响。 ";

"and others" = "有关更多指导，请访问以下链接。\n";

"More Information on roadmap" = "有关信息指南的更多信息";

"Changes are" = "即将进行变动，这些变动将会影响未来您对 Oracle Java SE 的发行版的访问权。\n\n";

"Corporate users" = "2019 年 4 月的更新将影响公司用户。\n\n";

"These changes" = "这些变更不会影响您将要安装的版本。";

"For additional" = "有关更多指导，请访问以下链接。\n\n";

"More Information..." = "详细信息...";

"Important Info" = "有关 Oracle Java SE 信息指南的重要信息";

"OK" = "确定";

"Java provides" = "Java 可以引领您步入由精彩内容构成的世界。从商业解决方案到有用的实用程序和娱乐应用，Java 使您的 Internet 体验生动有趣。\n\n";

"Note: No" = "注: 在我们的安装过程中, 不会收集个人信息。\n";

/* hyperlink - do not use punctuation */
"Click here" = "单击此处";

/* Click here for more information on what we do collect. is the full sentence */
" for more" = " 了解有关我们所收集内容的详细信息。";

"Click Install" = "单击“安装”以接受";

"license agreement" = "许可协议";

" and install" = "并立即安装 Java。";

"Install >" = "安装 >";

"Please remove" = "请删除过时的 Java 版本";

"The Java software" = "此计算机上的 Java 软件版本不是最新的，且没有适用于它的进一步更新。\n\n";

"Keeping out-of-date" = "在系统上保留过时的 Java 版本存在安全风险。\n\n";

"If you still" = "如果在删除后您仍需要使用 Java 来运行桌面应用程序，请访问";

" for a recommended" = " 来获取推荐版本。";

"Remove" = "删除 >";

"Java Deployment" = "Java 部署高速缓存";

"Java maintains" = "Java 会维护一个高速缓存，该高速缓存可加快重新加载常用 Java 程序的速度，并可以存储跟踪和日志文件。当您删除 Java 运行时的时候，建议同时删除此高速缓存，以便释放计算机上的空间。\n\n了解以下内容的详细信息：";

"Java Deployment Cache" = "Java 部署高速缓存";

"Would you like" = "\n\n是否要删除 Java 高速缓存（建议删除）？";

"Yes" = "是";

"No" = "否";

"Uninstalled" = "您已成功删除 Java";

"NoJavaToUninstall" = "在系统中未检测到 Java 安装";

"Complete" = "完成";

"Later" = "稍后";

"Update" = "更新";

"Please remove unused" = "请删除未使用的 Java 版本";

/* It appears that you have not used Java on your system in over 6 months. We recommend that you uninstall it by clicking the Remove button below. */
"It appears that" = "您系统中的 Java 已有 6 个月未使用。我们建议您卸载它：单击下面的";
" Remove" = "删除";
" button below." = "按钮。";

"If you later" = "如果您稍后决定需要 Java，可以从 java.com 重新安装它。";

/* If you wish to" = "If you wish to keep Java on your system, please update it by clicking the Update button below. */
"If you wish to" = "如果您想要在系统中保留 Java，请更新它：单击下面的";
" Update" = "更新";

"Fail to install" = "无法安装 Java";

"Uninstalling" = "正在卸载 Java...";

"Fail to uninstall" = "无法卸载 Java：%@";

"XPC connection error." = "XPC 连接错误。";

"Error code" = "OS 错误代码 %lld。";

"shell is not available." = "shell 不可用。";

"process cannot be created." = "进程无法创建。";

"Commercial License" = "此版本需要商用许可证";

"Use of this" = "使用此版本需要您拥有商用许可证。该许可证可以是您或您的软件提供商之一获得的商用许可证。";

"You can also" = "您还可以将此版本用于运行需要 Java 运行时的 Oracle 授权产品。";

"Learn more about this release" = "了解有关此发行版的详细信息。";

"Details on the" = "有关我们所收集信息的详细信息";

"cannot delete" = "无法删除 Java 部署高速缓存";

"Password prompt" = "%@ 需要具有权限才能继续。";

"Java Update" = "Java Update";

"OSCHECK_TITLE" = "Oracle 的 Java 要求 %1$@ %2$@ 或更高版本。";

"OSCHECK_MESSAGE" = "您的系统具有 %1$@ 版本 %2$@。此产品可安装在版本 %3$@ 或更高版本上。\n有关详细信息, 请访问 java.com/help。";

"Welcome to Java" = "欢迎使用 Java";

"This version" = "此 Java 版本需要您拥有 Oracle、授权的 Oracle 合作伙伴或授权的第三方软件提供商提供的 Oracle Java SE 许可证。由您负责确定自身是否拥有相应的许可证。如果有，请单击“安装”以继续执行安装过程。";

"If you have" = "如果您没有许可证，请单击“删除”以停止安装过程，并选择是否删除旧 Java 版本。";

"No personal" = "在我们的安装过程中, 不会收集个人信息";

"Welcome to Java -" = "欢迎使用 Java - 更新的许可证条款";

"The terms" = "授权使用此软件版本的条款已更改。";

"Updated License" = "更新的许可协议";

"This version -" = "此 Java 运行时版本仅授权供个人（非商用）台式机和笔记本电脑使用。";

"Commercial use" = "要对此软件进行商业使用，需要从 Oracle 或您的软件供应商获得单独的许可证。";

"Click install or" = "单击“安装”可接受许可协议并立即安装 Java，单击“删除”可从您的系统中卸载 Java。";

"Remove -" = "删除";
